MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q43/mcu.h
extern volatile CWG1INPPSbits_t CWG1INPPSbits __at(0x25B);
// bitfield macros
#define _CWG1INPPS_PIN_POSN                                 0x0
#define _CWG1INPPS_PIN_POSITION                             0x0
#define _CWG1INPPS_PIN_SIZE                                 0x3
#define _CWG1INPPS_PIN_LENGTH                               0x3
#define _CWG1INPPS_PIN_MASK                                 0x7
#define _CWG1INPPS_PORT_POSN                                0x3
#define _CWG1INPPS_PORT_POSITION                            0x3
#define _CWG1INPPS_PORT_SIZE                                0x2
#define _CWG1INPPS_PORT_LENGTH                              0x2
#define _CWG1INPPS_PORT_MASK                                0x18
#define _CWG1INPPS_CWGINPPS0_POSN                           0x0
#define _CWG1INPPS_CWGINPPS0_POSITION                       0x0
#define _CWG1INPPS_CWGINPPS0_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS0_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS0_MASK                           0x1
#define _CWG1INPPS_CWGINPPS1_POSN                           0x1
#define _CWG1INPPS_CWGINPPS1_POSITION                       0x1
#define _CWG1INPPS_CWGINPPS1_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS1_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS1_MASK                           0x2
#define _CWG1INPPS_CWGINPPS2_POSN                           0x2
#define _CWG1INPPS_CWGINPPS2_POSITION                       0x2
#define _CWG1INPPS_CWGINPPS2_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS2_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS2_MASK                           0x4
#define _CWG1INPPS_CWGINPPS3_POSN                           0x3
#define _CWG1INPPS_CWGINPPS3_POSITION                       0x3
#define _CWG1INPPS_CWGINPPS3_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS3_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS3_MASK                           0x8
#define _CWG1INPPS_CWGINPPS4_POSN                           0x4
#define _CWG1INPPS_CWGINPPS4_POSITION                       0x4
#define _CWG1INPPS_CWGINPPS4_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS4_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS4_MASK                           0x10
#define _CWG1INPPS_CWG1INPPS_POSN                           0x0
#define _CWG1INPPS_CWG1INPPS_POSITION                       0x0
#define _CWG1INPPS_CWG1INPPS_SIZE                           0x5
#define _CWG1INPPS_CWG1INPPS_LENGTH                         0x5
#define _CWG1INPPS_CWG1INPPS_MASK                           0x1F
#define _CWG1INPPS_CWG1INPPS0_POSN                          0x0
#define _CWG1INPPS_CWG1INPPS0_POSITION                      0x0
#define _CWG1INPPS_CWG1INPPS0_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS0_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS0_MASK                          0x1
#define _CWG1INPPS_CWG1INPPS1_POSN                          0x1
#define _CWG1INPPS_CWG1INPPS1_POSITION                      0x1
#define _CWG1INPPS_CWG1INPPS1_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS1_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS1_MASK                          0x2
#define _CWG1INPPS_CWG1INPPS2_POSN                          0x2
#define _CWG1INPPS_CWG1INPPS2_POSITION                      0x2
#define _CWG1INPPS_CWG1INPPS2_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS2_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS2_MASK                          0x4
#define _CWG1INPPS_CWG1INPPS3_POSN                          0x3
#define _CWG1INPPS_CWG1INPPS3_POSITION                      0x3
#define _CWG1INPPS_CWG1INPPS3_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS3_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS3_MASK                          0x8
#define _CWG1INPPS_CWG1INPPS4_POSN                          0x4
#define _CWG1INPPS_CWG1INPPS4_POSITION                      0x4
#define _CWG1INPPS_CWG1INPPS4_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS4_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS4_MASK                          0x10
#define _CWG1INPPS_CWGINPPS_POSN                            0x0
#define _CWG1INPPS_CWGINPPS_POSITION                        0x0
#define _CWG1INPPS_CWGINPPS_SIZE                            0x5
#define _CWG1INPPS_CWGINPPS_LENGTH                          0x5
#define _CWG1INPPS_CWGINPPS_MASK                            0x1F

// Register: CWG2PPS
#define CWG2PPS CWG2PPS
extern volatile unsigned char           CWG2PPS             __at(0x25C);
#ifndef _LIB_BUILD
asm("CWG2PPS equ 025Ch");
#endif
// aliases
extern volatile unsigned char           CWG2INPPS           __at(0x25C);
#ifndef _LIB_BUILD
asm("CWG2INPPS equ 025Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG2INPPS              :5;
    };
    struct {
        unsigned CWG2INPPS0             :1;
        unsigned CWG2INPPS1             :1;
        unsigned CWG2INPPS2             :1;
        unsigned CWG2INPPS3             :1;
        unsigned CWG2INPPS4             :1;
    };
    struct {
        unsigned CWGINPPS               :5;
    };
} CWG2PPSbits_t;
extern volatile CWG2PPSbits_t CWG2PPSbits __at(0x25C);
// bitfield macros
#define _CWG2PPS_PIN_POSN                                   0x0
#define _CWG2PPS_PIN_POSITION                               0x0
#define _CWG2PPS_PIN_SIZE                                   0x3
#define _CWG2PPS_PIN_LENGTH                                 0x3
#define _CWG2PPS_PIN_MASK                                   0x7
#define _CWG2PPS_PORT_POSN                                  0x3
#define _CWG2PPS_PORT_POSITION                              0x3
#define _CWG2PPS_PORT_SIZE                                  0x2
#define _CWG2PPS_PORT_LENGTH                                0x2
#define _CWG2PPS_PORT_MASK                                  0x18
#define _CWG2PPS_CWGINPPS0_POSN                             0x0
#define _CWG2PPS_CWGINPPS0_POSITION                         0x0
#define _CWG2PPS_CWGINPPS0_SIZE                             0x1
#define _CWG2PPS_CWGINPPS0_LENGTH                           0x1
#define _CWG2PPS_CWGINPPS0_MASK                             0x1
#define _CWG2PPS_CWGINPPS1_POSN                             0x1
#define _CWG2PPS_CWGINPPS1_POSITION                         0x1
#define _CWG2PPS_CWGINPPS1_SIZE                             0x1
#define _CWG2PPS_CWGINPPS1_LENGTH                           0x1
#define _CWG2PPS_CWGINPPS1_MASK                             0x2
#define _CWG2PPS_CWGINPPS2_POSN                             0x2
#define _CWG2PPS_CWGINPPS2_POSITION                         0x2
#define _CWG2PPS_CWGINPPS2_SIZE                             0x1
#define _CWG2PPS_CWGINPPS2_LENGTH                           0x1
#define _CWG2PPS_CWGINPPS2_MASK                             0x4
#define _CWG2PPS_CWGINPPS3_POSN                             0x3
#define _CWG2PPS_CWGINPPS3_POSITION                         0x3
#define _CWG2PPS_CWGINPPS3_SIZE                             0x1
#define _CWG2PPS_CWGINPPS3_LENGTH                           0x1
#define _CWG2PPS_CWGINPPS3_MASK                             0x8
#define _CWG2PPS_CWGINPPS4_POSN                             0x4
#define _CWG2PPS_CWGINPPS4_POSITION                         0x4
#define _CWG2PPS_CWGINPPS4_SIZE                             0x1
#define _CWG2PPS_CWGINPPS4_LENGTH                           0x1
#define _CWG2PPS_CWGINPPS4_MASK                             0x10
#define _CWG2PPS_CWG2INPPS_POSN                             0x0
#define _CWG2PPS_CWG2INPPS_POSITION                         0x0
#define _CWG2PPS_CWG2INPPS_SIZE                             0x5
#define _CWG2PPS_CWG2INPPS_LENGTH                           0x5
#define _CWG2PPS_CWG2INPPS_MASK                             0x1F
#define _CWG2PPS_CWG2INPPS0_POSN                            0x0
#define _CWG2PPS_CWG2INPPS0_POSITION                        0x0
#define _CWG2PPS_CWG2INPPS0_SIZE                            0x1
#define _CWG2PPS_CWG2INPPS0_LENGTH                          0x1
#define _CWG2PPS_CWG2INPPS0_MASK                            0x1
#define _CWG2PPS_CWG2INPPS1_POSN                            0x1
#define _CWG2PPS_CWG2INPPS1_POSITION                        0x1
#define _CWG2PPS_CWG2INPPS1_SIZE                            0x1
#define _CWG2PPS_CWG2INPPS1_LENGTH                          0x1
#define _CWG2PPS_CWG2INPPS1_MASK                            0x2
#define _CWG2PPS_CWG2INPPS2_POSN                            0x2
#define _CWG2PPS_CWG2INPPS2_POSITION                        0x2
#define _CWG2PPS_CWG2INPPS2_SIZE                            0x1
#define _CWG2PPS_CWG2INPPS2_LENGTH                          0x1
#define _CWG2PPS_CWG2INPPS2_MASK                            0x4
#define _CWG2PPS_CWG2INPPS3_POSN                            0x3
#define _CWG2PPS_CWG2INPPS3_POSITION                        0x3
#define _CWG2PPS_CWG2INPPS3_SIZE                            0x1
#define _CWG2PPS_CWG2INPPS3_LENGTH                          0x1
#define _CWG2PPS_CWG2INPPS3_MASK                            0x8
#define _CWG2PPS_CWG2INPPS4_POSN                            0x4
#define _CWG2PPS_CWG2INPPS4_POSITION                        0x4
#define _CWG2PPS_CWG2INPPS4_SIZE                            0x1
#define _CWG2PPS_CWG2INPPS4_LENGTH                          0x1
#define _CWG2PPS_CWG2INPPS4_MASK                            0x10
#define _CWG2PPS_CWGINPPS_POSN                              0x0
#define _CWG2PPS_CWGINPPS_POSITION                          0x0
#define _CWG2PPS_CWGINPPS_SIZE                              0x5
#define _CWG2PPS_CWGINPPS_LENGTH                            0x5
#define _CWG2PPS_CWGINPPS_MASK                              0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG2INPPS              :5;
    };
    struct {
        unsigned CWG2INPPS0             :1;
        unsigned CWG2INPPS1             :1;
        unsigned CWG2INPPS2             :1;
        unsigned CWG2INPPS3             :1;
        unsigned CWG2INPPS4             :1;
    };
    struct {
        unsigned CWGINPPS               :5;
    };
} CWG2INPPSbits_t;
extern volatile CWG2INPPSbits_t CWG2INPPSbits __at(0x25C);
// bitfield macros
#define _CWG2INPPS_PIN_POSN                                 0x0
#define _CWG2INPPS_PIN_POSITION                             0x0
#define _CWG2INPPS_PIN_SIZE                                 0x3
#define _CWG2INPPS_PIN_LENGTH                               0x3
#define _CWG2INPPS_PIN_MASK                                 0x7
#define _CWG2INPPS_PORT_POSN                                0x3
#define _CWG2INPPS_PORT_POSITION                            0x3
#define _CWG2INPPS_PORT_SIZE                                0x2
#define _CWG2INPPS_PORT_LENGTH                              0x2
#define _CWG2INPPS_PORT_MASK                                0x18
#define _CWG2INPPS_CWGINPPS0_POSN                           0x0
#define _CWG2INPPS_CWGINPPS0_POSITION                       0x0
#define _CWG2INPPS_CWGINPPS0_SIZE                           0x1
#define _CWG2INPPS_CWGINPPS0_LENGTH                         0x1
#define _CWG2INPPS_CWGINPPS0_MASK                           0x1
#define _CWG2INPPS_CWGINPPS1_POSN                           0x1
#define _CWG2INPPS_CWGINPPS1_POSITION                       0x1
#define _CWG2INPPS_CWGINPPS1_SIZE                           0x1
#define _CWG2INPPS_CWGINPPS1_LENGTH                         0x1
#define _CWG2INPPS_CWGINPPS1_MASK                           0x2
#define _CWG2INPPS_CWGINPPS2_POSN                           0x2
#define _CWG2INPPS_CWGINPPS2_POSITION                       0x2
#define _CWG2INPPS_CWGINPPS2_SIZE                           0x1
#define _CWG2INPPS_CWGINPPS2_LENGTH                         0x1
#define _CWG2INPPS_CWGINPPS2_MASK                           0x4
#define _CWG2INPPS_CWGINPPS3_POSN                           0x3
#define _CWG2INPPS_CWGINPPS3_POSITION                       0x3
#define _CWG2INPPS_CWGINPPS3_SIZE                           0x1
#define _CWG2INPPS_CWGINPPS3_LENGTH                         0x1
#define _CWG2INPPS_CWGINPPS3_MASK                           0x8
#define _CWG2INPPS_CWGINPPS4_POSN                           0x4
#define _CWG2INPPS_CWGINPPS4_POSITION                       0x4
#define _CWG2INPPS_CWGINPPS4_SIZE                           0x1
#define _CWG2INPPS_CWGINPPS4_LENGTH                         0x1
#define _CWG2INPPS_CWGINPPS4_MASK                           0x10
#define _CWG2INPPS_CWG2INPPS_POSN                           0x0
#define _CWG2INPPS_CWG2INPPS_POSITION                       0x0
#define _CWG2INPPS_CWG2INPPS_SIZE                           0x5
#define _CWG2INPPS_CWG2INPPS_LENGTH                         0x5
#define _CWG2INPPS_CWG2INPPS_MASK                           0x1F
#define _CWG2INPPS_CWG2INPPS0_POSN                          0x0
#define _CWG2INPPS_CWG2INPPS0_POSITION                      0x0
#define _CWG2INPPS_CWG2INPPS0_SIZE                          0x1
#define _CWG2INPPS_CWG2INPPS0_LENGTH                        0x1
#define _CWG2INPPS_CWG2INPPS0_MASK                          0x1
#define _CWG2INPPS_CWG2INPPS1_POSN                          0x1
#define _CWG2INPPS_CWG2INPPS1_POSITION                      0x1
#define _CWG2INPPS_CWG2INPPS1_SIZE                          0x1
#define _CWG2INPPS_CWG2INPPS1_LENGTH                        0x1
#define _CWG2INPPS_CWG2INPPS1_MASK                          0x2
#define _CWG2INPPS_CWG2INPPS2_POSN                          0x2
#define _CWG2INPPS_CWG2INPPS2_POSITION                      0x2
#define _CWG2INPPS_CWG2INPPS2_SIZE                          0x1
#define _CWG2INPPS_CWG2INPPS2_LENGTH                        0x1
#define _CWG2INPPS_CWG2INPPS2_MASK                          0x4
#define _CWG2INPPS_CWG2INPPS3_POSN                          0x3
#define _CWG2INPPS_CWG2INPPS3_POSITION                      0x3
#define _CWG2INPPS_CWG2INPPS3_SIZE                          0x1
#define _CWG2INPPS_CWG2INPPS3_LENGTH                        0x1
#define _CWG2INPPS_CWG2INPPS3_MASK                          0x8
#define _CWG2INPPS_CWG2INPPS4_POSN                          0x4
#define _CWG2INPPS_CWG2INPPS4_POSITION                      0x4
#define _CWG2INPPS_CWG2INPPS4_SIZE                          0x1
#define _CWG2INPPS_CWG2INPPS4_LENGTH                        0x1
#define _CWG2INPPS_CWG2INPPS4_MASK                          0x10
#define _CWG2INPPS_CWGINPPS_POSN                            0x0
#define _CWG2INPPS_CWGINPPS_POSITION                        0x0
#define _CWG2INPPS_CWGINPPS_SIZE                            0x5
#define _CWG2INPPS_CWGINPPS_LENGTH                          0x5
#define _CWG2INPPS_CWGINPPS_MASK                            0x1F

// Register: CWG3PPS
#define CWG3PPS CWG3PPS
extern volatile unsigned char           CWG3PPS             __at(0x25D);
#ifndef _LIB_BUILD
asm("CWG3PPS equ 025Dh");
#endif
// aliases
extern volatile unsigned char           CWG3INPPS           __at(0x25D);
#ifndef _LIB_BUILD
asm("CWG3INPPS equ 025Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG3INPPS              :5;
    };
    struct {
        unsigned CWG3INPPS0             :1;
        unsigned CWG3INPPS1             :1;
        unsigned CWG3INPPS2             :1;
        unsigned CWG3INPPS3             :1;
        unsigned CWG3INPPS4             :1;
    };
    struct {
        unsigned CWGINPPS               :5;
    };
} CWG3PPSbits_t;
extern volatile CWG3PPSbits_t CWG3PPSbits __at(0x25D);
// bitfield macros
#define _CWG3PPS_PIN_POSN                                   0x0
#define _CWG3PPS_PIN_POSITION                               0x0
#define _CWG3PPS_PIN_SIZE                                   0x3
#define _CWG3PPS_PIN_LENGTH                                 0x3
#define _CWG3PPS_PIN_MASK                                   0x7
#define _CWG3PPS_PORT_POSN                                  0x3
#define _CWG3PPS_PORT_POSITION                              0x3
#define _CWG3PPS_PORT_SIZE                                  0x2
#define _CWG3PPS_PORT_LENGTH                                0x2
#define _CWG3PPS_PORT_MASK                                  0x18
#define _CWG3PPS_CWGINPPS0_POSN                             0x0
#define _CWG3PPS_CWGINPPS0_POSITION                         0x0
#define _CWG3PPS_CWGINPPS0_SIZE                             0x1
#define _CWG3PPS_CWGINPPS0_LENGTH                           0x1
#define _CWG3PPS_CWGINPPS0_MASK                             0x1
#define _CWG3PPS_CWGINPPS1_POSN                             0x1
#define _CWG3PPS_CWGINPPS1_POSITION                         0x1
#define _CWG3PPS_CWGINPPS1_SIZE                             0x1
#define _CWG3PPS_CWGINPPS1_LENGTH                           0x1
#define _CWG3PPS_CWGINPPS1_MASK                             0x2
#define _CWG3PPS_CWGINPPS2_POSN                             0x2
#define _CWG3PPS_CWGINPPS2_POSITION                         0x2
#define _CWG3PPS_CWGINPPS2_SIZE                             0x1
#define _CWG3PPS_CWGINPPS2_LENGTH                           0x1
#define _CWG3PPS_CWGINPPS2_MASK                             0x4
#define _CWG3PPS_CWGINPPS3_POSN                             0x3
#define _CWG3PPS_CWGINPPS3_POSITION                         0x3
#define _CWG3PPS_CWGINPPS3_SIZE                             0x1
#define _CWG3PPS_CWGINPPS3_LENGTH                           0x1
#define _CWG3PPS_CWGINPPS3_MASK                             0x8
#define _CWG3PPS_CWGINPPS4_POSN                             0x4
#define _CWG3PPS_CWGINPPS4_POSITION                         0x4
#define _CWG3PPS_CWGINPPS4_SIZE                             0x1
#define _CWG3PPS_CWGINPPS4_LENGTH                           0x1
#define _CWG3PPS_CWGINPPS4_MASK                             0x10
#define _CWG3PPS_CWG3INPPS_POSN                             0x0
#define _CWG3PPS_CWG3INPPS_POSITION                         0x0
#define _CWG3PPS_CWG3INPPS_SIZE                             0x5
#define _CWG3PPS_CWG3INPPS_LENGTH                           0x5
#define _CWG3PPS_CWG3INPPS_MASK                             0x1F
#define _CWG3PPS_CWG3INPPS0_POSN                            0x0
#define _CWG3PPS_CWG3INPPS0_POSITION                        0x0
#define _CWG3PPS_CWG3INPPS0_SIZE                            0x1
#define _CWG3PPS_CWG3INPPS0_LENGTH                          0x1
#define _CWG3PPS_CWG3INPPS0_MASK                            0x1
#define _CWG3PPS_CWG3INPPS1_POSN                            0x1
#define _CWG3PPS_CWG3INPPS1_POSITION                        0x1
#define _CWG3PPS_CWG3INPPS1_SIZE                            0x1
#define _CWG3PPS_CWG3INPPS1_LENGTH                          0x1
#define _CWG3PPS_CWG3INPPS1_MASK                            0x2
#define _CWG3PPS_CWG3INPPS2_POSN                            0x2
#define _CWG3PPS_CWG3INPPS2_POSITION                        0x2
#define _CWG3PPS_CWG3INPPS2_SIZE                            0x1
#define _CWG3PPS_CWG3INPPS2_LENGTH                          0x1
#define _CWG3PPS_CWG3INPPS2_MASK                            0x4
#define _CWG3PPS_CWG3INPPS3_POSN                            0x3
#define _CWG3PPS_CWG3INPPS3_POSITION                        0x3
#define _CWG3PPS_CWG3INPPS3_SIZE                            0x1
#define _CWG3PPS_CWG3INPPS3_LENGTH                          0x1
#define _CWG3PPS_CWG3INPPS3_MASK                            0x8
#define _CWG3PPS_CWG3INPPS4_POSN                            0x4
#define _CWG3PPS_CWG3INPPS4_POSITION                        0x4
#define _CWG3PPS_CWG3INPPS4_SIZE                            0x1
#define _CWG3PPS_CWG3INPPS4_LENGTH                          0x1
#define _CWG3PPS_CWG3INPPS4_MASK                            0x10
#define _CWG3PPS_CWGINPPS_POSN                              0x0
#define _CWG3PPS_CWGINPPS_POSITION                          0x0
#define _CWG3PPS_CWGINPPS_SIZE                              0x5
#define _CWG3PPS_CWGINPPS_LENGTH                            0x5
#define _CWG3PPS_CWGINPPS_MASK                              0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG3INPPS              :5;
    };
    struct {
        unsigned CWG3INPPS0             :1;
        unsigned CWG3INPPS1             :1;
        unsigned CWG3INPPS2             :1;
        unsigned CWG3INPPS3             :1;
        unsigned CWG3INPPS4             :1;
    };
    struct {
        unsigned CWGINPPS               :5;
    };
} CWG3INPPSbits_t;
