MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q43/mcu.h
// Register: IPR14
#define IPR14 IPR14
extern volatile unsigned char           IPR14               __at(0x370);
#ifndef _LIB_BUILD
asm("IPR14 equ 0370h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CLC7IP                 :1;
        unsigned C2IP                   :1;
        unsigned NCO3IP                 :1;
    };
} IPR14bits_t;
extern volatile IPR14bits_t IPR14bits __at(0x370);
// bitfield macros
#define _IPR14_CLC7IP_POSN                                  0x1
#define _IPR14_CLC7IP_POSITION                              0x1
#define _IPR14_CLC7IP_SIZE                                  0x1
#define _IPR14_CLC7IP_LENGTH                                0x1
#define _IPR14_CLC7IP_MASK                                  0x2
#define _IPR14_C2IP_POSN                                    0x2
#define _IPR14_C2IP_POSITION                                0x2
#define _IPR14_C2IP_SIZE                                    0x1
#define _IPR14_C2IP_LENGTH                                  0x1
#define _IPR14_C2IP_MASK                                    0x4
#define _IPR14_NCO3IP_POSN                                  0x3
#define _IPR14_NCO3IP_POSITION                              0x3
#define _IPR14_NCO3IP_SIZE                                  0x1
#define _IPR14_NCO3IP_LENGTH                                0x1
#define _IPR14_NCO3IP_MASK                                  0x8

// Register: IPR15
#define IPR15 IPR15
extern volatile unsigned char           IPR15               __at(0x371);
#ifndef _LIB_BUILD
asm("IPR15 equ 0371h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMIP                  :1;
        unsigned CLC8IP                 :1;
        unsigned CRCIP                  :1;
        unsigned TMR6IP                 :1;
    };
} IPR15bits_t;
extern volatile IPR15bits_t IPR15bits __at(0x371);
// bitfield macros
#define _IPR15_NVMIP_POSN                                   0x0
#define _IPR15_NVMIP_POSITION                               0x0
#define _IPR15_NVMIP_SIZE                                   0x1
#define _IPR15_NVMIP_LENGTH                                 0x1
#define _IPR15_NVMIP_MASK                                   0x1
#define _IPR15_CLC8IP_POSN                                  0x1
#define _IPR15_CLC8IP_POSITION                              0x1
#define _IPR15_CLC8IP_SIZE                                  0x1
#define _IPR15_CLC8IP_LENGTH                                0x1
#define _IPR15_CLC8IP_MASK                                  0x2
#define _IPR15_CRCIP_POSN                                   0x2
#define _IPR15_CRCIP_POSITION                               0x2
#define _IPR15_CRCIP_SIZE                                   0x1
#define _IPR15_CRCIP_LENGTH                                 0x1
#define _IPR15_CRCIP_MASK                                   0x4
#define _IPR15_TMR6IP_POSN                                  0x3
#define _IPR15_TMR6IP_POSITION                              0x3
#define _IPR15_TMR6IP_SIZE                                  0x1
#define _IPR15_TMR6IP_LENGTH                                0x1
#define _IPR15_TMR6IP_MASK                                  0x8

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
extern volatile unsigned char           STATUS_CSHAD        __at(0x373);
#ifndef _LIB_BUILD
asm("STATUS_CSHAD equ 0373h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUS_CSHADbits_t;
extern volatile STATUS_CSHADbits_t STATUS_CSHADbits __at(0x373);
// bitfield macros
#define _STATUS_CSHAD_NOT_PD_POSN                           0x5
#define _STATUS_CSHAD_NOT_PD_POSITION                       0x5
#define _STATUS_CSHAD_NOT_PD_SIZE                           0x1
#define _STATUS_CSHAD_NOT_PD_LENGTH                         0x1
#define _STATUS_CSHAD_NOT_PD_MASK                           0x20
#define _STATUS_CSHAD_NOT_TO_POSN                           0x6
#define _STATUS_CSHAD_NOT_TO_POSITION                       0x6
#define _STATUS_CSHAD_NOT_TO_SIZE                           0x1
#define _STATUS_CSHAD_NOT_TO_LENGTH                         0x1
#define _STATUS_CSHAD_NOT_TO_MASK                           0x40
#define _STATUS_CSHAD_C_POSN                                0x0
#define _STATUS_CSHAD_C_POSITION                            0x0
#define _STATUS_CSHAD_C_SIZE                                0x1
#define _STATUS_CSHAD_C_LENGTH                              0x1
#define _STATUS_CSHAD_C_MASK                                0x1
#define _STATUS_CSHAD_DC_POSN                               0x1
#define _STATUS_CSHAD_DC_POSITION                           0x1
#define _STATUS_CSHAD_DC_SIZE                               0x1
#define _STATUS_CSHAD_DC_LENGTH                             0x1
#define _STATUS_CSHAD_DC_MASK                               0x2
#define _STATUS_CSHAD_Z_POSN                                0x2
#define _STATUS_CSHAD_Z_POSITION                            0x2
#define _STATUS_CSHAD_Z_SIZE                                0x1
#define _STATUS_CSHAD_Z_LENGTH                              0x1
#define _STATUS_CSHAD_Z_MASK                                0x4
#define _STATUS_CSHAD_OV_POSN                               0x3
#define _STATUS_CSHAD_OV_POSITION                           0x3
#define _STATUS_CSHAD_OV_SIZE                               0x1
#define _STATUS_CSHAD_OV_LENGTH                             0x1
#define _STATUS_CSHAD_OV_MASK                               0x8
#define _STATUS_CSHAD_N_POSN                                0x4
#define _STATUS_CSHAD_N_POSITION                            0x4
#define _STATUS_CSHAD_N_SIZE                                0x1
#define _STATUS_CSHAD_N_LENGTH                              0x1
#define _STATUS_CSHAD_N_MASK                                0x10
#define _STATUS_CSHAD_nPD_POSN                              0x5
#define _STATUS_CSHAD_nPD_POSITION                          0x5
#define _STATUS_CSHAD_nPD_SIZE                              0x1
#define _STATUS_CSHAD_nPD_LENGTH                            0x1
#define _STATUS_CSHAD_nPD_MASK                              0x20
#define _STATUS_CSHAD_nTO_POSN                              0x6
#define _STATUS_CSHAD_nTO_POSITION                          0x6
#define _STATUS_CSHAD_nTO_SIZE                              0x1
#define _STATUS_CSHAD_nTO_LENGTH                            0x1
#define _STATUS_CSHAD_nTO_MASK                              0x40
#define _STATUS_CSHAD_PD_POSN                               0x5
#define _STATUS_CSHAD_PD_POSITION                           0x5
#define _STATUS_CSHAD_PD_SIZE                               0x1
#define _STATUS_CSHAD_PD_LENGTH                             0x1
#define _STATUS_CSHAD_PD_MASK                               0x20
#define _STATUS_CSHAD_TO_POSN                               0x6
#define _STATUS_CSHAD_TO_POSITION                           0x6
#define _STATUS_CSHAD_TO_SIZE                               0x1
#define _STATUS_CSHAD_TO_LENGTH                             0x1
#define _STATUS_CSHAD_TO_MASK                               0x40

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
extern volatile unsigned char           WREG_CSHAD          __at(0x374);
#ifndef _LIB_BUILD
asm("WREG_CSHAD equ 0374h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREG_CSHADbits_t;
