MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q43/mcu.h
extern volatile NCO3ACCHbits_t NCO3ACCHbits __at(0x451);
// bitfield macros
#define _NCO3ACCH_ACC_POSN                                  0x0
#define _NCO3ACCH_ACC_POSITION                              0x0
#define _NCO3ACCH_ACC_SIZE                                  0x8
#define _NCO3ACCH_ACC_LENGTH                                0x8
#define _NCO3ACCH_ACC_MASK                                  0xFF
#define _NCO3ACCH_NCO3ACC8_POSN                             0x0
#define _NCO3ACCH_NCO3ACC8_POSITION                         0x0
#define _NCO3ACCH_NCO3ACC8_SIZE                             0x1
#define _NCO3ACCH_NCO3ACC8_LENGTH                           0x1
#define _NCO3ACCH_NCO3ACC8_MASK                             0x1
#define _NCO3ACCH_NCO3ACC9_POSN                             0x1
#define _NCO3ACCH_NCO3ACC9_POSITION                         0x1
#define _NCO3ACCH_NCO3ACC9_SIZE                             0x1
#define _NCO3ACCH_NCO3ACC9_LENGTH                           0x1
#define _NCO3ACCH_NCO3ACC9_MASK                             0x2
#define _NCO3ACCH_NCO3ACC10_POSN                            0x2
#define _NCO3ACCH_NCO3ACC10_POSITION                        0x2
#define _NCO3ACCH_NCO3ACC10_SIZE                            0x1
#define _NCO3ACCH_NCO3ACC10_LENGTH                          0x1
#define _NCO3ACCH_NCO3ACC10_MASK                            0x4
#define _NCO3ACCH_NCO3ACC11_POSN                            0x3
#define _NCO3ACCH_NCO3ACC11_POSITION                        0x3
#define _NCO3ACCH_NCO3ACC11_SIZE                            0x1
#define _NCO3ACCH_NCO3ACC11_LENGTH                          0x1
#define _NCO3ACCH_NCO3ACC11_MASK                            0x8
#define _NCO3ACCH_NCO3ACC12_POSN                            0x4
#define _NCO3ACCH_NCO3ACC12_POSITION                        0x4
#define _NCO3ACCH_NCO3ACC12_SIZE                            0x1
#define _NCO3ACCH_NCO3ACC12_LENGTH                          0x1
#define _NCO3ACCH_NCO3ACC12_MASK                            0x10
#define _NCO3ACCH_NCO3ACC13_POSN                            0x5
#define _NCO3ACCH_NCO3ACC13_POSITION                        0x5
#define _NCO3ACCH_NCO3ACC13_SIZE                            0x1
#define _NCO3ACCH_NCO3ACC13_LENGTH                          0x1
#define _NCO3ACCH_NCO3ACC13_MASK                            0x20
#define _NCO3ACCH_NCO3ACC14_POSN                            0x6
#define _NCO3ACCH_NCO3ACC14_POSITION                        0x6
#define _NCO3ACCH_NCO3ACC14_SIZE                            0x1
#define _NCO3ACCH_NCO3ACC14_LENGTH                          0x1
#define _NCO3ACCH_NCO3ACC14_MASK                            0x40
#define _NCO3ACCH_NCO3ACC15_POSN                            0x7
#define _NCO3ACCH_NCO3ACC15_POSITION                        0x7
#define _NCO3ACCH_NCO3ACC15_SIZE                            0x1
#define _NCO3ACCH_NCO3ACC15_LENGTH                          0x1
#define _NCO3ACCH_NCO3ACC15_MASK                            0x80
#define _NCO3ACCH_ACC8_POSN                                 0x0
#define _NCO3ACCH_ACC8_POSITION                             0x0
#define _NCO3ACCH_ACC8_SIZE                                 0x1
#define _NCO3ACCH_ACC8_LENGTH                               0x1
#define _NCO3ACCH_ACC8_MASK                                 0x1
#define _NCO3ACCH_ACC9_POSN                                 0x1
#define _NCO3ACCH_ACC9_POSITION                             0x1
#define _NCO3ACCH_ACC9_SIZE                                 0x1
#define _NCO3ACCH_ACC9_LENGTH                               0x1
#define _NCO3ACCH_ACC9_MASK                                 0x2
#define _NCO3ACCH_ACC10_POSN                                0x2
#define _NCO3ACCH_ACC10_POSITION                            0x2
#define _NCO3ACCH_ACC10_SIZE                                0x1
#define _NCO3ACCH_ACC10_LENGTH                              0x1
#define _NCO3ACCH_ACC10_MASK                                0x4
#define _NCO3ACCH_ACC11_POSN                                0x3
#define _NCO3ACCH_ACC11_POSITION                            0x3
#define _NCO3ACCH_ACC11_SIZE                                0x1
#define _NCO3ACCH_ACC11_LENGTH                              0x1
#define _NCO3ACCH_ACC11_MASK                                0x8
#define _NCO3ACCH_ACC12_POSN                                0x4
#define _NCO3ACCH_ACC12_POSITION                            0x4
#define _NCO3ACCH_ACC12_SIZE                                0x1
#define _NCO3ACCH_ACC12_LENGTH                              0x1
#define _NCO3ACCH_ACC12_MASK                                0x10
#define _NCO3ACCH_ACC13_POSN                                0x5
#define _NCO3ACCH_ACC13_POSITION                            0x5
#define _NCO3ACCH_ACC13_SIZE                                0x1
#define _NCO3ACCH_ACC13_LENGTH                              0x1
#define _NCO3ACCH_ACC13_MASK                                0x20
#define _NCO3ACCH_ACC14_POSN                                0x6
#define _NCO3ACCH_ACC14_POSITION                            0x6
#define _NCO3ACCH_ACC14_SIZE                                0x1
#define _NCO3ACCH_ACC14_LENGTH                              0x1
#define _NCO3ACCH_ACC14_MASK                                0x40
#define _NCO3ACCH_ACC15_POSN                                0x7
#define _NCO3ACCH_ACC15_POSITION                            0x7
#define _NCO3ACCH_ACC15_SIZE                                0x1
#define _NCO3ACCH_ACC15_LENGTH                              0x1
#define _NCO3ACCH_ACC15_MASK                                0x80
#define _NCO3ACCH_NCO3ACC_POSN                              0x0
#define _NCO3ACCH_NCO3ACC_POSITION                          0x0
#define _NCO3ACCH_NCO3ACC_SIZE                              0x8
#define _NCO3ACCH_NCO3ACC_LENGTH                            0x8
#define _NCO3ACCH_NCO3ACC_MASK                              0xFF

// Register: NCO3ACCU
#define NCO3ACCU NCO3ACCU
extern volatile unsigned char           NCO3ACCU            __at(0x452);
#ifndef _LIB_BUILD
asm("NCO3ACCU equ 0452h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :4;
    };
    struct {
        unsigned NCO3ACC16              :1;
        unsigned NCO3ACC17              :1;
        unsigned NCO3ACC18              :1;
        unsigned NCO3ACC19              :1;
    };
    struct {
        unsigned ACC16                  :1;
        unsigned ACC17                  :1;
        unsigned ACC18                  :1;
        unsigned ACC19                  :1;
    };
    struct {
        unsigned NCO3ACC                :4;
    };
} NCO3ACCUbits_t;
extern volatile NCO3ACCUbits_t NCO3ACCUbits __at(0x452);
// bitfield macros
#define _NCO3ACCU_ACC_POSN                                  0x0
#define _NCO3ACCU_ACC_POSITION                              0x0
#define _NCO3ACCU_ACC_SIZE                                  0x4
#define _NCO3ACCU_ACC_LENGTH                                0x4
#define _NCO3ACCU_ACC_MASK                                  0xF
#define _NCO3ACCU_NCO3ACC16_POSN                            0x0
#define _NCO3ACCU_NCO3ACC16_POSITION                        0x0
#define _NCO3ACCU_NCO3ACC16_SIZE                            0x1
#define _NCO3ACCU_NCO3ACC16_LENGTH                          0x1
#define _NCO3ACCU_NCO3ACC16_MASK                            0x1
#define _NCO3ACCU_NCO3ACC17_POSN                            0x1
#define _NCO3ACCU_NCO3ACC17_POSITION                        0x1
#define _NCO3ACCU_NCO3ACC17_SIZE                            0x1
#define _NCO3ACCU_NCO3ACC17_LENGTH                          0x1
#define _NCO3ACCU_NCO3ACC17_MASK                            0x2
#define _NCO3ACCU_NCO3ACC18_POSN                            0x2
#define _NCO3ACCU_NCO3ACC18_POSITION                        0x2
#define _NCO3ACCU_NCO3ACC18_SIZE                            0x1
#define _NCO3ACCU_NCO3ACC18_LENGTH                          0x1
#define _NCO3ACCU_NCO3ACC18_MASK                            0x4
#define _NCO3ACCU_NCO3ACC19_POSN                            0x3
#define _NCO3ACCU_NCO3ACC19_POSITION                        0x3
#define _NCO3ACCU_NCO3ACC19_SIZE                            0x1
#define _NCO3ACCU_NCO3ACC19_LENGTH                          0x1
#define _NCO3ACCU_NCO3ACC19_MASK                            0x8
#define _NCO3ACCU_ACC16_POSN                                0x0
#define _NCO3ACCU_ACC16_POSITION                            0x0
#define _NCO3ACCU_ACC16_SIZE                                0x1
#define _NCO3ACCU_ACC16_LENGTH                              0x1
#define _NCO3ACCU_ACC16_MASK                                0x1
#define _NCO3ACCU_ACC17_POSN                                0x1
#define _NCO3ACCU_ACC17_POSITION                            0x1
#define _NCO3ACCU_ACC17_SIZE                                0x1
#define _NCO3ACCU_ACC17_LENGTH                              0x1
#define _NCO3ACCU_ACC17_MASK                                0x2
#define _NCO3ACCU_ACC18_POSN                                0x2
#define _NCO3ACCU_ACC18_POSITION                            0x2
#define _NCO3ACCU_ACC18_SIZE                                0x1
#define _NCO3ACCU_ACC18_LENGTH                              0x1
#define _NCO3ACCU_ACC18_MASK                                0x4
#define _NCO3ACCU_ACC19_POSN                                0x3
#define _NCO3ACCU_ACC19_POSITION                            0x3
#define _NCO3ACCU_ACC19_SIZE                                0x1
#define _NCO3ACCU_ACC19_LENGTH                              0x1
#define _NCO3ACCU_ACC19_MASK                                0x8
#define _NCO3ACCU_NCO3ACC_POSN                              0x0
#define _NCO3ACCU_NCO3ACC_POSITION                          0x0
#define _NCO3ACCU_NCO3ACC_SIZE                              0x4
#define _NCO3ACCU_NCO3ACC_LENGTH                            0x4
#define _NCO3ACCU_NCO3ACC_MASK                              0xF

// Register: NCO3INC
#define NCO3INC NCO3INC
#ifndef __CCI__
extern volatile __uint24                NCO3INC             __at(0x453);
#endif
#ifndef _LIB_BUILD
asm("NCO3INC equ 0453h");
#endif

