MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q43/mcu.h
// Register: INDF1
#define INDF1 INDF1
extern volatile unsigned char           INDF1               __at(0x4E7);
#ifndef _LIB_BUILD
asm("INDF1 equ 04E7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INDF1                  :8;
    };
} INDF1bits_t;
extern volatile INDF1bits_t INDF1bits __at(0x4E7);
// bitfield macros
#define _INDF1_INDF1_POSN                                   0x0
#define _INDF1_INDF1_POSITION                               0x0
#define _INDF1_INDF1_SIZE                                   0x8
#define _INDF1_INDF1_LENGTH                                 0x8
#define _INDF1_INDF1_MASK                                   0xFF

// Register: WREG
#define WREG WREG
extern volatile unsigned char           WREG                __at(0x4E8);
#ifndef _LIB_BUILD
asm("WREG equ 04E8h");
#endif
// aliases
// extern volatile unsigned char           W                   __at(0x4E8);
#ifndef _LIB_BUILD
// asm("W equ 04E8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREGbits_t;
extern volatile WREGbits_t WREGbits __at(0x4E8);
// bitfield macros
#define _WREG_WREG_POSN                                     0x0
#define _WREG_WREG_POSITION                                 0x0
#define _WREG_WREG_SIZE                                     0x8
#define _WREG_WREG_LENGTH                                   0x8
#define _WREG_WREG_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} Wbits_t;
extern volatile Wbits_t Wbits __at(0x4E8);
// bitfield macros
#define _W_WREG_POSN                                        0x0
#define _W_WREG_POSITION                                    0x0
#define _W_WREG_SIZE                                        0x8
#define _W_WREG_LENGTH                                      0x8
#define _W_WREG_MASK                                        0xFF

// Register: FSR0
#define FSR0 FSR0
extern volatile unsigned short          FSR0                __at(0x4E9);
#ifndef _LIB_BUILD
asm("FSR0 equ 04E9h");
#endif

// Register: FSR0L
#define FSR0L FSR0L
extern volatile unsigned char           FSR0L               __at(0x4E9);
#ifndef _LIB_BUILD
asm("FSR0L equ 04E9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0L                  :8;
    };
} FSR0Lbits_t;
extern volatile FSR0Lbits_t FSR0Lbits __at(0x4E9);
// bitfield macros
#define _FSR0L_FSR0L_POSN                                   0x0
#define _FSR0L_FSR0L_POSITION                               0x0
#define _FSR0L_FSR0L_SIZE                                   0x8
#define _FSR0L_FSR0L_LENGTH                                 0x8
#define _FSR0L_FSR0L_MASK                                   0xFF

// Register: FSR0H
#define FSR0H FSR0H
extern volatile unsigned char           FSR0H               __at(0x4EA);
#ifndef _LIB_BUILD
asm("FSR0H equ 04EAh");
#endif

// Register: PLUSW0
#define PLUSW0 PLUSW0
extern volatile unsigned char           PLUSW0              __at(0x4EB);
#ifndef _LIB_BUILD
asm("PLUSW0 equ 04EBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLUSW0                 :8;
    };
} PLUSW0bits_t;
extern volatile PLUSW0bits_t PLUSW0bits __at(0x4EB);
// bitfield macros
#define _PLUSW0_PLUSW0_POSN                                 0x0
#define _PLUSW0_PLUSW0_POSITION                             0x0
#define _PLUSW0_PLUSW0_SIZE                                 0x8
#define _PLUSW0_PLUSW0_LENGTH                               0x8
#define _PLUSW0_PLUSW0_MASK                                 0xFF

// Register: PREINC0
#define PREINC0 PREINC0
extern volatile unsigned char           PREINC0             __at(0x4EC);
#ifndef _LIB_BUILD
asm("PREINC0 equ 04ECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PREINC0                :8;
    };
} PREINC0bits_t;
extern volatile PREINC0bits_t PREINC0bits __at(0x4EC);
// bitfield macros
#define _PREINC0_PREINC0_POSN                               0x0
#define _PREINC0_PREINC0_POSITION                           0x0
#define _PREINC0_PREINC0_SIZE                               0x8
#define _PREINC0_PREINC0_LENGTH                             0x8
#define _PREINC0_PREINC0_MASK                               0xFF

// Register: POSTDEC0
#define POSTDEC0 POSTDEC0
extern volatile unsigned char           POSTDEC0            __at(0x4ED);
#ifndef _LIB_BUILD
asm("POSTDEC0 equ 04EDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTDEC0               :8;
    };
} POSTDEC0bits_t;
extern volatile POSTDEC0bits_t POSTDEC0bits __at(0x4ED);
// bitfield macros
#define _POSTDEC0_POSTDEC0_POSN                             0x0
#define _POSTDEC0_POSTDEC0_POSITION                         0x0
#define _POSTDEC0_POSTDEC0_SIZE                             0x8
#define _POSTDEC0_POSTDEC0_LENGTH                           0x8
#define _POSTDEC0_POSTDEC0_MASK                             0xFF

// Register: POSTINC0
#define POSTINC0 POSTINC0
extern volatile unsigned char           POSTINC0            __at(0x4EE);
#ifndef _LIB_BUILD
asm("POSTINC0 equ 04EEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTINC0               :8;
    };
} POSTINC0bits_t;
extern volatile POSTINC0bits_t POSTINC0bits __at(0x4EE);
// bitfield macros
#define _POSTINC0_POSTINC0_POSN                             0x0
#define _POSTINC0_POSTINC0_POSITION                         0x0
#define _POSTINC0_POSTINC0_SIZE                             0x8
#define _POSTINC0_POSTINC0_LENGTH                           0x8
#define _POSTINC0_POSTINC0_MASK                             0xFF

// Register: INDF0
#define INDF0 INDF0
extern volatile unsigned char           INDF0               __at(0x4EF);
#ifndef _LIB_BUILD
asm("INDF0 equ 04EFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INDF0                  :8;
    };
} INDF0bits_t;
extern volatile INDF0bits_t INDF0bits __at(0x4EF);
// bitfield macros
#define _INDF0_INDF0_POSN                                   0x0
#define _INDF0_INDF0_POSITION                               0x0
#define _INDF0_INDF0_SIZE                                   0x8
#define _INDF0_INDF0_LENGTH                                 0x8
#define _INDF0_INDF0_MASK                                   0xFF

// Register: PCON0
#define PCON0 PCON0
extern volatile unsigned char           PCON0               __at(0x4F0);
#ifndef _LIB_BUILD
asm("PCON0 equ 04F0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NOT_BOR                :1;
    };
    struct {
        unsigned                        :1;
        unsigned NOT_POR                :1;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_RI                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_RMCLR              :1;
    };
    struct {
        unsigned                        :4;
        unsigned NOT_RWDT               :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_WDTWV              :1;
    };
    struct {
        unsigned nBOR                   :1;
        unsigned nPOR                   :1;
        unsigned nRI                    :1;
        unsigned nRMCLR                 :1;
        unsigned nRWDT                  :1;
        unsigned nWDTWV                 :1;
        unsigned STKUNF                 :1;
        unsigned STKOVF                 :1;
    };
    struct {
        unsigned BOR                    :1;
        unsigned POR                    :1;
        unsigned RI                     :1;
        unsigned RMCLR                  :1;
        unsigned RWDT                   :1;
        unsigned WDTWV                  :1;
    };
} PCON0bits_t;
extern volatile PCON0bits_t PCON0bits __at(0x4F0);
// bitfield macros
#define _PCON0_NOT_BOR_POSN                                 0x0
#define _PCON0_NOT_BOR_POSITION                             0x0
#define _PCON0_NOT_BOR_SIZE                                 0x1
#define _PCON0_NOT_BOR_LENGTH                               0x1
#define _PCON0_NOT_BOR_MASK                                 0x1
#define _PCON0_NOT_POR_POSN                                 0x1
#define _PCON0_NOT_POR_POSITION                             0x1
#define _PCON0_NOT_POR_SIZE                                 0x1
#define _PCON0_NOT_POR_LENGTH                               0x1
#define _PCON0_NOT_POR_MASK                                 0x2
#define _PCON0_NOT_RI_POSN                                  0x2
#define _PCON0_NOT_RI_POSITION                              0x2
#define _PCON0_NOT_RI_SIZE                                  0x1
#define _PCON0_NOT_RI_LENGTH                                0x1
#define _PCON0_NOT_RI_MASK                                  0x4
#define _PCON0_NOT_RMCLR_POSN                               0x3
#define _PCON0_NOT_RMCLR_POSITION                           0x3
#define _PCON0_NOT_RMCLR_SIZE                               0x1
#define _PCON0_NOT_RMCLR_LENGTH                             0x1
#define _PCON0_NOT_RMCLR_MASK                               0x8
#define _PCON0_NOT_RWDT_POSN                                0x4
#define _PCON0_NOT_RWDT_POSITION                            0x4
#define _PCON0_NOT_RWDT_SIZE                                0x1
#define _PCON0_NOT_RWDT_LENGTH                              0x1
#define _PCON0_NOT_RWDT_MASK                                0x10
#define _PCON0_NOT_WDTWV_POSN                               0x5
#define _PCON0_NOT_WDTWV_POSITION                           0x5
#define _PCON0_NOT_WDTWV_SIZE                               0x1
#define _PCON0_NOT_WDTWV_LENGTH                             0x1
#define _PCON0_NOT_WDTWV_MASK                               0x20
#define _PCON0_nBOR_POSN                                    0x0
#define _PCON0_nBOR_POSITION                                0x0
#define _PCON0_nBOR_SIZE                                    0x1
#define _PCON0_nBOR_LENGTH                                  0x1
#define _PCON0_nBOR_MASK                                    0x1
#define _PCON0_nPOR_POSN                                    0x1
#define _PCON0_nPOR_POSITION                                0x1
#define _PCON0_nPOR_SIZE                                    0x1
#define _PCON0_nPOR_LENGTH                                  0x1
#define _PCON0_nPOR_MASK                                    0x2
#define _PCON0_nRI_POSN                                     0x2
#define _PCON0_nRI_POSITION                                 0x2
#define _PCON0_nRI_SIZE                                     0x1
#define _PCON0_nRI_LENGTH                                   0x1
#define _PCON0_nRI_MASK                                     0x4
#define _PCON0_nRMCLR_POSN                                  0x3
#define _PCON0_nRMCLR_POSITION                              0x3
#define _PCON0_nRMCLR_SIZE                                  0x1
#define _PCON0_nRMCLR_LENGTH                                0x1
#define _PCON0_nRMCLR_MASK                                  0x8
#define _PCON0_nRWDT_POSN                                   0x4
#define _PCON0_nRWDT_POSITION                               0x4
#define _PCON0_nRWDT_SIZE                                   0x1
#define _PCON0_nRWDT_LENGTH                                 0x1
#define _PCON0_nRWDT_MASK                                   0x10
#define _PCON0_nWDTWV_POSN                                  0x5
#define _PCON0_nWDTWV_POSITION                              0x5
#define _PCON0_nWDTWV_SIZE                                  0x1
#define _PCON0_nWDTWV_LENGTH                                0x1
#define _PCON0_nWDTWV_MASK                                  0x20
#define _PCON0_STKUNF_POSN                                  0x6
#define _PCON0_STKUNF_POSITION                              0x6
#define _PCON0_STKUNF_SIZE                                  0x1
#define _PCON0_STKUNF_LENGTH                                0x1
#define _PCON0_STKUNF_MASK                                  0x40
#define _PCON0_STKOVF_POSN                                  0x7
#define _PCON0_STKOVF_POSITION                              0x7
#define _PCON0_STKOVF_SIZE                                  0x1
#define _PCON0_STKOVF_LENGTH                                0x1
#define _PCON0_STKOVF_MASK                                  0x80
#define _PCON0_BOR_POSN                                     0x0
#define _PCON0_BOR_POSITION                                 0x0
#define _PCON0_BOR_SIZE                                     0x1
#define _PCON0_BOR_LENGTH                                   0x1
#define _PCON0_BOR_MASK                                     0x1
#define _PCON0_POR_POSN                                     0x1
#define _PCON0_POR_POSITION                                 0x1
#define _PCON0_POR_SIZE                                     0x1
#define _PCON0_POR_LENGTH                                   0x1
#define _PCON0_POR_MASK                                     0x2
#define _PCON0_RI_POSN                                      0x2
#define _PCON0_RI_POSITION                                  0x2
#define _PCON0_RI_SIZE                                      0x1
#define _PCON0_RI_LENGTH                                    0x1
#define _PCON0_RI_MASK                                      0x4
#define _PCON0_RMCLR_POSN                                   0x3
#define _PCON0_RMCLR_POSITION                               0x3
#define _PCON0_RMCLR_SIZE                                   0x1
#define _PCON0_RMCLR_LENGTH                                 0x1
#define _PCON0_RMCLR_MASK                                   0x8
#define _PCON0_RWDT_POSN                                    0x4
#define _PCON0_RWDT_POSITION                                0x4
#define _PCON0_RWDT_SIZE                                    0x1
#define _PCON0_RWDT_LENGTH                                  0x1
#define _PCON0_RWDT_MASK                                    0x10
#define _PCON0_WDTWV_POSN                                   0x5
#define _PCON0_WDTWV_POSITION                               0x5
#define _PCON0_WDTWV_SIZE                                   0x1
#define _PCON0_WDTWV_LENGTH                                 0x1
#define _PCON0_WDTWV_MASK                                   0x20

// Register: PCON1
#define PCON1 PCON1
extern volatile unsigned char           PCON1               __at(0x4F1);
#ifndef _LIB_BUILD
asm("PCON1 equ 04F1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NOT_RCM                :1;
    };
    struct {
        unsigned                        :1;
        unsigned NOT_MEMV               :1;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_RVREG              :1;
    };
    struct {
        unsigned nRCM                   :1;
        unsigned nMEMV                  :1;
        unsigned nRVREG                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned MEMV                   :1;
    };
} PCON1bits_t;
extern volatile PCON1bits_t PCON1bits __at(0x4F1);
// bitfield macros
#define _PCON1_NOT_RCM_POSN                                 0x0
#define _PCON1_NOT_RCM_POSITION                             0x0
#define _PCON1_NOT_RCM_SIZE                                 0x1
#define _PCON1_NOT_RCM_LENGTH                               0x1
#define _PCON1_NOT_RCM_MASK                                 0x1
#define _PCON1_NOT_MEMV_POSN                                0x1
#define _PCON1_NOT_MEMV_POSITION                            0x1
#define _PCON1_NOT_MEMV_SIZE                                0x1
#define _PCON1_NOT_MEMV_LENGTH                              0x1
#define _PCON1_NOT_MEMV_MASK                                0x2
#define _PCON1_NOT_RVREG_POSN                               0x2
#define _PCON1_NOT_RVREG_POSITION                           0x2
#define _PCON1_NOT_RVREG_SIZE                               0x1
#define _PCON1_NOT_RVREG_LENGTH                             0x1
#define _PCON1_NOT_RVREG_MASK                               0x4
#define _PCON1_nRCM_POSN                                    0x0
#define _PCON1_nRCM_POSITION                                0x0
#define _PCON1_nRCM_SIZE                                    0x1
#define _PCON1_nRCM_LENGTH                                  0x1
#define _PCON1_nRCM_MASK                                    0x1
#define _PCON1_nMEMV_POSN                                   0x1
#define _PCON1_nMEMV_POSITION                               0x1
#define _PCON1_nMEMV_SIZE                                   0x1
#define _PCON1_nMEMV_LENGTH                                 0x1
#define _PCON1_nMEMV_MASK                                   0x2
#define _PCON1_nRVREG_POSN                                  0x2
#define _PCON1_nRVREG_POSITION                              0x2
#define _PCON1_nRVREG_SIZE                                  0x1
#define _PCON1_nRVREG_LENGTH                                0x1
#define _PCON1_nRVREG_MASK                                  0x4
#define _PCON1_MEMV_POSN                                    0x1
#define _PCON1_MEMV_POSITION                                0x1
#define _PCON1_MEMV_SIZE                                    0x1
#define _PCON1_MEMV_LENGTH                                  0x1
#define _PCON1_MEMV_MASK                                    0x2

