MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q43/mcu.h
#define                                 PWM1PIP_bit         _BIT_ACCESS(IPR4,6)
// PWM2ERSPPS<PWM2ERSPPS0>
extern volatile __bit                   PWM2ERSPPS0         __at(0x12A0);	// @ (0x254 * 8 + 0)
#define                                 PWM2ERSPPS0_bit     _BIT_ACCESS(PWM2ERSPPS,0)
// PWM2ERSPPS<PWM2ERSPPS1>
extern volatile __bit                   PWM2ERSPPS1         __at(0x12A1);	// @ (0x254 * 8 + 1)
#define                                 PWM2ERSPPS1_bit     _BIT_ACCESS(PWM2ERSPPS,1)
// PWM2ERSPPS<PWM2ERSPPS2>
extern volatile __bit                   PWM2ERSPPS2         __at(0x12A2);	// @ (0x254 * 8 + 2)
#define                                 PWM2ERSPPS2_bit     _BIT_ACCESS(PWM2ERSPPS,2)
// PWM2ERSPPS<PWM2ERSPPS3>
extern volatile __bit                   PWM2ERSPPS3         __at(0x12A3);	// @ (0x254 * 8 + 3)
#define                                 PWM2ERSPPS3_bit     _BIT_ACCESS(PWM2ERSPPS,3)
// PWM2ERSPPS<PWM2ERSPPS4>
extern volatile __bit                   PWM2ERSPPS4         __at(0x12A4);	// @ (0x254 * 8 + 4)
#define                                 PWM2ERSPPS4_bit     _BIT_ACCESS(PWM2ERSPPS,4)
// PWM2ERSPPS<PWM2ERSPPS5>
extern volatile __bit                   PWM2ERSPPS5         __at(0x12A5);	// @ (0x254 * 8 + 5)
#define                                 PWM2ERSPPS5_bit     _BIT_ACCESS(PWM2ERSPPS,5)
// PIE5<PWM2IE>
extern volatile __bit                   PWM2IE              __at(0x251F);	// @ (0x4A3 * 8 + 7)
#define                                 PWM2IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<PWM2IF>
extern volatile __bit                   PWM2IF              __at(0x259F);	// @ (0x4B3 * 8 + 7)
#define                                 PWM2IF_bit          _BIT_ACCESS(PIR5,7)
// IPR5<PWM2IP>
extern volatile __bit                   PWM2IP              __at(0x1B3F);	// @ (0x367 * 8 + 7)
#define                                 PWM2IP_bit          _BIT_ACCESS(IPR5,7)
// PMD5<PWM2MD>
extern volatile __bit                   PWM2MD              __at(0x32D);	// @ (0x65 * 8 + 5)
#define                                 PWM2MD_bit          _BIT_ACCESS(PMD5,5)
// PIE5<PWM2PIE>
extern volatile __bit                   PWM2PIE             __at(0x251E);	// @ (0x4A3 * 8 + 6)
#define                                 PWM2PIE_bit         _BIT_ACCESS(PIE5,6)
// PIR5<PWM2PIF>
extern volatile __bit                   PWM2PIF             __at(0x259E);	// @ (0x4B3 * 8 + 6)
#define                                 PWM2PIF_bit         _BIT_ACCESS(PIR5,6)
// IPR5<PWM2PIP>
extern volatile __bit                   PWM2PIP             __at(0x1B3E);	// @ (0x367 * 8 + 6)
#define                                 PWM2PIP_bit         _BIT_ACCESS(IPR5,6)
// PWM3ERSPPS<PWM3ERSPPS0>
extern volatile __bit                   PWM3ERSPPS0         __at(0x12A8);	// @ (0x255 * 8 + 0)
#define                                 PWM3ERSPPS0_bit     _BIT_ACCESS(PWM3ERSPPS,0)
// PWM3ERSPPS<PWM3ERSPPS1>
extern volatile __bit                   PWM3ERSPPS1         __at(0x12A9);	// @ (0x255 * 8 + 1)
#define                                 PWM3ERSPPS1_bit     _BIT_ACCESS(PWM3ERSPPS,1)
// PWM3ERSPPS<PWM3ERSPPS2>
extern volatile __bit                   PWM3ERSPPS2         __at(0x12AA);	// @ (0x255 * 8 + 2)
#define                                 PWM3ERSPPS2_bit     _BIT_ACCESS(PWM3ERSPPS,2)
// PWM3ERSPPS<PWM3ERSPPS3>
extern volatile __bit                   PWM3ERSPPS3         __at(0x12AB);	// @ (0x255 * 8 + 3)
#define                                 PWM3ERSPPS3_bit     _BIT_ACCESS(PWM3ERSPPS,3)
// PWM3ERSPPS<PWM3ERSPPS4>
extern volatile __bit                   PWM3ERSPPS4         __at(0x12AC);	// @ (0x255 * 8 + 4)
#define                                 PWM3ERSPPS4_bit     _BIT_ACCESS(PWM3ERSPPS,4)
// PIE7<PWM3IE>
extern volatile __bit                   PWM3IE              __at(0x252F);	// @ (0x4A5 * 8 + 7)
#define                                 PWM3IE_bit          _BIT_ACCESS(PIE7,7)
// PIR7<PWM3IF>
extern volatile __bit                   PWM3IF              __at(0x25AF);	// @ (0x4B5 * 8 + 7)
#define                                 PWM3IF_bit          _BIT_ACCESS(PIR7,7)
// IPR7<PWM3IP>
extern volatile __bit                   PWM3IP              __at(0x1B4F);	// @ (0x369 * 8 + 7)
#define                                 PWM3IP_bit          _BIT_ACCESS(IPR7,7)
// PMD5<PWM3MD>
extern volatile __bit                   PWM3MD              __at(0x32E);	// @ (0x65 * 8 + 6)
#define                                 PWM3MD_bit          _BIT_ACCESS(PMD5,6)
// PIE7<PWM3PIE>
extern volatile __bit                   PWM3PIE             __at(0x252E);	// @ (0x4A5 * 8 + 6)
#define                                 PWM3PIE_bit         _BIT_ACCESS(PIE7,6)
// PIR7<PWM3PIF>
extern volatile __bit                   PWM3PIF             __at(0x25AE);	// @ (0x4B5 * 8 + 6)
#define                                 PWM3PIF_bit         _BIT_ACCESS(PIR7,6)
// IPR7<PWM3PIP>
extern volatile __bit                   PWM3PIP             __at(0x1B4E);	// @ (0x369 * 8 + 6)
#define                                 PWM3PIP_bit         _BIT_ACCESS(IPR7,6)
// PWMIN0PPS<PWMIN0PPS0>
extern volatile __bit                   PWMIN0PPS0          __at(0x12B8);	// @ (0x257 * 8 + 0)
#define                                 PWMIN0PPS0_bit      _BIT_ACCESS(PWMIN0PPS,0)
// PWMIN0PPS<PWMIN0PPS1>
extern volatile __bit                   PWMIN0PPS1          __at(0x12B9);	// @ (0x257 * 8 + 1)
#define                                 PWMIN0PPS1_bit      _BIT_ACCESS(PWMIN0PPS,1)
// PWMIN0PPS<PWMIN0PPS2>
extern volatile __bit                   PWMIN0PPS2          __at(0x12BA);	// @ (0x257 * 8 + 2)
#define                                 PWMIN0PPS2_bit      _BIT_ACCESS(PWMIN0PPS,2)
// PWMIN0PPS<PWMIN0PPS3>
extern volatile __bit                   PWMIN0PPS3          __at(0x12BB);	// @ (0x257 * 8 + 3)
#define                                 PWMIN0PPS3_bit      _BIT_ACCESS(PWMIN0PPS,3)
// PWMIN0PPS<PWMIN0PPS4>
extern volatile __bit                   PWMIN0PPS4          __at(0x12BC);	// @ (0x257 * 8 + 4)
#define                                 PWMIN0PPS4_bit      _BIT_ACCESS(PWMIN0PPS,4)
// PWMIN0PPS<PWMIN0PPS5>
extern volatile __bit                   PWMIN0PPS5          __at(0x12BD);	// @ (0x257 * 8 + 5)
#define                                 PWMIN0PPS5_bit      _BIT_ACCESS(PWMIN0PPS,5)
// PWMIN1PPS<PWMIN1PPS0>
extern volatile __bit                   PWMIN1PPS0          __at(0x12C0);	// @ (0x258 * 8 + 0)
#define                                 PWMIN1PPS0_bit      _BIT_ACCESS(PWMIN1PPS,0)
// PWMIN1PPS<PWMIN1PPS1>
extern volatile __bit                   PWMIN1PPS1          __at(0x12C1);	// @ (0x258 * 8 + 1)
#define                                 PWMIN1PPS1_bit      _BIT_ACCESS(PWMIN1PPS,1)
// PWMIN1PPS<PWMIN1PPS2>
extern volatile __bit                   PWMIN1PPS2          __at(0x12C2);	// @ (0x258 * 8 + 2)
#define                                 PWMIN1PPS2_bit      _BIT_ACCESS(PWMIN1PPS,2)
// PWMIN1PPS<PWMIN1PPS3>
extern volatile __bit                   PWMIN1PPS3          __at(0x12C3);	// @ (0x258 * 8 + 3)
#define                                 PWMIN1PPS3_bit      _BIT_ACCESS(PWMIN1PPS,3)
// PWMIN1PPS<PWMIN1PPS4>
extern volatile __bit                   PWMIN1PPS4          __at(0x12C4);	// @ (0x258 * 8 + 4)
#define                                 PWMIN1PPS4_bit      _BIT_ACCESS(PWMIN1PPS,4)
// PWMIN1PPS<PWMIN1PPS5>
extern volatile __bit                   PWMIN1PPS5          __at(0x12C5);	// @ (0x258 * 8 + 5)
#define                                 PWMIN1PPS5_bit      _BIT_ACCESS(PWMIN1PPS,5)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x2670);	// @ (0x4CE * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x1008);	// @ (0x201 * 8 + 0)
#define                                 RA0PPS0_bit         _BIT_ACCESS(RA0PPS,0)
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x1009);	// @ (0x201 * 8 + 1)
#define                                 RA0PPS1_bit         _BIT_ACCESS(RA0PPS,1)
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x100A);	// @ (0x201 * 8 + 2)
#define                                 RA0PPS2_bit         _BIT_ACCESS(RA0PPS,2)
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x100B);	// @ (0x201 * 8 + 3)
#define                                 RA0PPS3_bit         _BIT_ACCESS(RA0PPS,3)
// RA0PPS<RA0PPS4>
extern volatile __bit                   RA0PPS4             __at(0x100C);	// @ (0x201 * 8 + 4)
#define                                 RA0PPS4_bit         _BIT_ACCESS(RA0PPS,4)
// RA0PPS<RA0PPS5>
extern volatile __bit                   RA0PPS5             __at(0x100D);	// @ (0x201 * 8 + 5)
#define                                 RA0PPS5_bit         _BIT_ACCESS(RA0PPS,5)
// RA0PPS<RA0PPS6>
extern volatile __bit                   RA0PPS6             __at(0x100E);	// @ (0x201 * 8 + 6)
#define                                 RA0PPS6_bit         _BIT_ACCESS(RA0PPS,6)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x2671);	// @ (0x4CE * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// RA1PPS<RA1PPS0>
extern volatile __bit                   RA1PPS0             __at(0x1010);	// @ (0x202 * 8 + 0)
#define                                 RA1PPS0_bit         _BIT_ACCESS(RA1PPS,0)
// RA1PPS<RA1PPS1>
extern volatile __bit                   RA1PPS1             __at(0x1011);	// @ (0x202 * 8 + 1)
#define                                 RA1PPS1_bit         _BIT_ACCESS(RA1PPS,1)
// RA1PPS<RA1PPS2>
extern volatile __bit                   RA1PPS2             __at(0x1012);	// @ (0x202 * 8 + 2)
#define                                 RA1PPS2_bit         _BIT_ACCESS(RA1PPS,2)
// RA1PPS<RA1PPS3>
extern volatile __bit                   RA1PPS3             __at(0x1013);	// @ (0x202 * 8 + 3)
#define                                 RA1PPS3_bit         _BIT_ACCESS(RA1PPS,3)
// RA1PPS<RA1PPS4>
extern volatile __bit                   RA1PPS4             __at(0x1014);	// @ (0x202 * 8 + 4)
#define                                 RA1PPS4_bit         _BIT_ACCESS(RA1PPS,4)
// RA1PPS<RA1PPS5>
extern volatile __bit                   RA1PPS5             __at(0x1015);	// @ (0x202 * 8 + 5)
#define                                 RA1PPS5_bit         _BIT_ACCESS(RA1PPS,5)
// RA1PPS<RA1PPS6>
extern volatile __bit                   RA1PPS6             __at(0x1016);	// @ (0x202 * 8 + 6)
#define                                 RA1PPS6_bit         _BIT_ACCESS(RA1PPS,6)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x2672);	// @ (0x4CE * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// RA2PPS<RA2PPS0>
extern volatile __bit                   RA2PPS0             __at(0x1018);	// @ (0x203 * 8 + 0)
#define                                 RA2PPS0_bit         _BIT_ACCESS(RA2PPS,0)
// RA2PPS<RA2PPS1>
extern volatile __bit                   RA2PPS1             __at(0x1019);	// @ (0x203 * 8 + 1)
#define                                 RA2PPS1_bit         _BIT_ACCESS(RA2PPS,1)
// RA2PPS<RA2PPS2>
extern volatile __bit                   RA2PPS2             __at(0x101A);	// @ (0x203 * 8 + 2)
#define                                 RA2PPS2_bit         _BIT_ACCESS(RA2PPS,2)
// RA2PPS<RA2PPS3>
extern volatile __bit                   RA2PPS3             __at(0x101B);	// @ (0x203 * 8 + 3)
#define                                 RA2PPS3_bit         _BIT_ACCESS(RA2PPS,3)
// RA2PPS<RA2PPS4>
extern volatile __bit                   RA2PPS4             __at(0x101C);	// @ (0x203 * 8 + 4)
#define                                 RA2PPS4_bit         _BIT_ACCESS(RA2PPS,4)
// RA2PPS<RA2PPS5>
extern volatile __bit                   RA2PPS5             __at(0x101D);	// @ (0x203 * 8 + 5)
#define                                 RA2PPS5_bit         _BIT_ACCESS(RA2PPS,5)
// RA2PPS<RA2PPS6>
extern volatile __bit                   RA2PPS6             __at(0x101E);	// @ (0x203 * 8 + 6)
#define                                 RA2PPS6_bit         _BIT_ACCESS(RA2PPS,6)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x2673);	// @ (0x4CE * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// RA3PPS<RA3PPS0>
extern volatile __bit                   RA3PPS0             __at(0x1020);	// @ (0x204 * 8 + 0)
#define                                 RA3PPS0_bit         _BIT_ACCESS(RA3PPS,0)
// RA3PPS<RA3PPS1>
extern volatile __bit                   RA3PPS1             __at(0x1021);	// @ (0x204 * 8 + 1)
#define                                 RA3PPS1_bit         _BIT_ACCESS(RA3PPS,1)
// RA3PPS<RA3PPS2>
extern volatile __bit                   RA3PPS2             __at(0x1022);	// @ (0x204 * 8 + 2)
#define                                 RA3PPS2_bit         _BIT_ACCESS(RA3PPS,2)
// RA3PPS<RA3PPS3>
extern volatile __bit                   RA3PPS3             __at(0x1023);	// @ (0x204 * 8 + 3)
#define                                 RA3PPS3_bit         _BIT_ACCESS(RA3PPS,3)
// RA3PPS<RA3PPS4>
extern volatile __bit                   RA3PPS4             __at(0x1024);	// @ (0x204 * 8 + 4)
#define                                 RA3PPS4_bit         _BIT_ACCESS(RA3PPS,4)
// RA3PPS<RA3PPS5>
extern volatile __bit                   RA3PPS5             __at(0x1025);	// @ (0x204 * 8 + 5)
#define                                 RA3PPS5_bit         _BIT_ACCESS(RA3PPS,5)
// RA3PPS<RA3PPS6>
extern volatile __bit                   RA3PPS6             __at(0x1026);	// @ (0x204 * 8 + 6)
#define                                 RA3PPS6_bit         _BIT_ACCESS(RA3PPS,6)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x2674);	// @ (0x4CE * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// RA4PPS<RA4PPS0>
extern volatile __bit                   RA4PPS0             __at(0x1028);	// @ (0x205 * 8 + 0)
#define                                 RA4PPS0_bit         _BIT_ACCESS(RA4PPS,0)
// RA4PPS<RA4PPS1>
extern volatile __bit                   RA4PPS1             __at(0x1029);	// @ (0x205 * 8 + 1)
#define                                 RA4PPS1_bit         _BIT_ACCESS(RA4PPS,1)
// RA4PPS<RA4PPS2>
extern volatile __bit                   RA4PPS2             __at(0x102A);	// @ (0x205 * 8 + 2)
#define                                 RA4PPS2_bit         _BIT_ACCESS(RA4PPS,2)
// RA4PPS<RA4PPS3>
extern volatile __bit                   RA4PPS3             __at(0x102B);	// @ (0x205 * 8 + 3)
#define                                 RA4PPS3_bit         _BIT_ACCESS(RA4PPS,3)
// RA4PPS<RA4PPS4>
extern volatile __bit                   RA4PPS4             __at(0x102C);	// @ (0x205 * 8 + 4)
#define                                 RA4PPS4_bit         _BIT_ACCESS(RA4PPS,4)
// RA4PPS<RA4PPS5>
extern volatile __bit                   RA4PPS5             __at(0x102D);	// @ (0x205 * 8 + 5)
#define                                 RA4PPS5_bit         _BIT_ACCESS(RA4PPS,5)
// RA4PPS<RA4PPS6>
extern volatile __bit                   RA4PPS6             __at(0x102E);	// @ (0x205 * 8 + 6)
#define                                 RA4PPS6_bit         _BIT_ACCESS(RA4PPS,6)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x2675);	// @ (0x4CE * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// RA5PPS<RA5PPS0>
extern volatile __bit                   RA5PPS0             __at(0x1030);	// @ (0x206 * 8 + 0)
#define                                 RA5PPS0_bit         _BIT_ACCESS(RA5PPS,0)
// RA5PPS<RA5PPS1>
extern volatile __bit                   RA5PPS1             __at(0x1031);	// @ (0x206 * 8 + 1)
#define                                 RA5PPS1_bit         _BIT_ACCESS(RA5PPS,1)
// RA5PPS<RA5PPS2>
extern volatile __bit                   RA5PPS2             __at(0x1032);	// @ (0x206 * 8 + 2)
#define                                 RA5PPS2_bit         _BIT_ACCESS(RA5PPS,2)
// RA5PPS<RA5PPS3>
extern volatile __bit                   RA5PPS3             __at(0x1033);	// @ (0x206 * 8 + 3)
#define                                 RA5PPS3_bit         _BIT_ACCESS(RA5PPS,3)
// RA5PPS<RA5PPS4>
extern volatile __bit                   RA5PPS4             __at(0x1034);	// @ (0x206 * 8 + 4)
#define                                 RA5PPS4_bit         _BIT_ACCESS(RA5PPS,4)
// RA5PPS<RA5PPS5>
extern volatile __bit                   RA5PPS5             __at(0x1035);	// @ (0x206 * 8 + 5)
#define                                 RA5PPS5_bit         _BIT_ACCESS(RA5PPS,5)
// RA5PPS<RA5PPS6>
extern volatile __bit                   RA5PPS6             __at(0x1036);	// @ (0x206 * 8 + 6)
#define                                 RA5PPS6_bit         _BIT_ACCESS(RA5PPS,6)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x2676);	// @ (0x4CE * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// RA6PPS<RA6PPS0>
extern volatile __bit                   RA6PPS0             __at(0x1038);	// @ (0x207 * 8 + 0)
#define                                 RA6PPS0_bit         _BIT_ACCESS(RA6PPS,0)
// RA6PPS<RA6PPS1>
extern volatile __bit                   RA6PPS1             __at(0x1039);	// @ (0x207 * 8 + 1)
#define                                 RA6PPS1_bit         _BIT_ACCESS(RA6PPS,1)
// RA6PPS<RA6PPS2>
extern volatile __bit                   RA6PPS2             __at(0x103A);	// @ (0x207 * 8 + 2)
#define                                 RA6PPS2_bit         _BIT_ACCESS(RA6PPS,2)
// RA6PPS<RA6PPS3>
extern volatile __bit                   RA6PPS3             __at(0x103B);	// @ (0x207 * 8 + 3)
#define                                 RA6PPS3_bit         _BIT_ACCESS(RA6PPS,3)
// RA6PPS<RA6PPS4>
extern volatile __bit                   RA6PPS4             __at(0x103C);	// @ (0x207 * 8 + 4)
#define                                 RA6PPS4_bit         _BIT_ACCESS(RA6PPS,4)
// RA6PPS<RA6PPS5>
extern volatile __bit                   RA6PPS5             __at(0x103D);	// @ (0x207 * 8 + 5)
#define                                 RA6PPS5_bit         _BIT_ACCESS(RA6PPS,5)
// RA6PPS<RA6PPS6>
extern volatile __bit                   RA6PPS6             __at(0x103E);	// @ (0x207 * 8 + 6)
#define                                 RA6PPS6_bit         _BIT_ACCESS(RA6PPS,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x2677);	// @ (0x4CE * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// RA7PPS<RA7PPS0>
extern volatile __bit                   RA7PPS0             __at(0x1040);	// @ (0x208 * 8 + 0)
#define                                 RA7PPS0_bit         _BIT_ACCESS(RA7PPS,0)
// RA7PPS<RA7PPS1>
extern volatile __bit                   RA7PPS1             __at(0x1041);	// @ (0x208 * 8 + 1)
#define                                 RA7PPS1_bit         _BIT_ACCESS(RA7PPS,1)
// RA7PPS<RA7PPS2>
extern volatile __bit                   RA7PPS2             __at(0x1042);	// @ (0x208 * 8 + 2)
#define                                 RA7PPS2_bit         _BIT_ACCESS(RA7PPS,2)
// RA7PPS<RA7PPS3>
extern volatile __bit                   RA7PPS3             __at(0x1043);	// @ (0x208 * 8 + 3)
#define                                 RA7PPS3_bit         _BIT_ACCESS(RA7PPS,3)
// RA7PPS<RA7PPS4>
extern volatile __bit                   RA7PPS4             __at(0x1044);	// @ (0x208 * 8 + 4)
#define                                 RA7PPS4_bit         _BIT_ACCESS(RA7PPS,4)
// RA7PPS<RA7PPS5>
extern volatile __bit                   RA7PPS5             __at(0x1045);	// @ (0x208 * 8 + 5)
#define                                 RA7PPS5_bit         _BIT_ACCESS(RA7PPS,5)
// RA7PPS<RA7PPS6>
extern volatile __bit                   RA7PPS6             __at(0x1046);	// @ (0x208 * 8 + 6)
#define                                 RA7PPS6_bit         _BIT_ACCESS(RA7PPS,6)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x2678);	// @ (0x4CF * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// RB0PPS<RB0PPS0>
extern volatile __bit                   RB0PPS0             __at(0x1048);	// @ (0x209 * 8 + 0)
#define                                 RB0PPS0_bit         _BIT_ACCESS(RB0PPS,0)
// RB0PPS<RB0PPS1>
extern volatile __bit                   RB0PPS1             __at(0x1049);	// @ (0x209 * 8 + 1)
#define                                 RB0PPS1_bit         _BIT_ACCESS(RB0PPS,1)
// RB0PPS<RB0PPS2>
extern volatile __bit                   RB0PPS2             __at(0x104A);	// @ (0x209 * 8 + 2)
#define                                 RB0PPS2_bit         _BIT_ACCESS(RB0PPS,2)
// RB0PPS<RB0PPS3>
extern volatile __bit                   RB0PPS3             __at(0x104B);	// @ (0x209 * 8 + 3)
#define                                 RB0PPS3_bit         _BIT_ACCESS(RB0PPS,3)
// RB0PPS<RB0PPS4>
extern volatile __bit                   RB0PPS4             __at(0x104C);	// @ (0x209 * 8 + 4)
#define                                 RB0PPS4_bit         _BIT_ACCESS(RB0PPS,4)
// RB0PPS<RB0PPS5>
extern volatile __bit                   RB0PPS5             __at(0x104D);	// @ (0x209 * 8 + 5)
#define                                 RB0PPS5_bit         _BIT_ACCESS(RB0PPS,5)
// RB0PPS<RB0PPS6>
extern volatile __bit                   RB0PPS6             __at(0x104E);	// @ (0x209 * 8 + 6)
#define                                 RB0PPS6_bit         _BIT_ACCESS(RB0PPS,6)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x2679);	// @ (0x4CF * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// RB1PPS<RB1PPS0>
extern volatile __bit                   RB1PPS0             __at(0x1050);	// @ (0x20A * 8 + 0)
#define                                 RB1PPS0_bit         _BIT_ACCESS(RB1PPS,0)
// RB1PPS<RB1PPS1>
extern volatile __bit                   RB1PPS1             __at(0x1051);	// @ (0x20A * 8 + 1)
#define                                 RB1PPS1_bit         _BIT_ACCESS(RB1PPS,1)
// RB1PPS<RB1PPS2>
extern volatile __bit                   RB1PPS2             __at(0x1052);	// @ (0x20A * 8 + 2)
#define                                 RB1PPS2_bit         _BIT_ACCESS(RB1PPS,2)
// RB1PPS<RB1PPS3>
extern volatile __bit                   RB1PPS3             __at(0x1053);	// @ (0x20A * 8 + 3)
#define                                 RB1PPS3_bit         _BIT_ACCESS(RB1PPS,3)
// RB1PPS<RB1PPS4>
extern volatile __bit                   RB1PPS4             __at(0x1054);	// @ (0x20A * 8 + 4)
#define                                 RB1PPS4_bit         _BIT_ACCESS(RB1PPS,4)
// RB1PPS<RB1PPS5>
extern volatile __bit                   RB1PPS5             __at(0x1055);	// @ (0x20A * 8 + 5)
#define                                 RB1PPS5_bit         _BIT_ACCESS(RB1PPS,5)
// RB1PPS<RB1PPS6>
extern volatile __bit                   RB1PPS6             __at(0x1056);	// @ (0x20A * 8 + 6)
#define                                 RB1PPS6_bit         _BIT_ACCESS(RB1PPS,6)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x267A);	// @ (0x4CF * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// RB2PPS<RB2PPS0>
extern volatile __bit                   RB2PPS0             __at(0x1058);	// @ (0x20B * 8 + 0)
#define                                 RB2PPS0_bit         _BIT_ACCESS(RB2PPS,0)
// RB2PPS<RB2PPS1>
extern volatile __bit                   RB2PPS1             __at(0x1059);	// @ (0x20B * 8 + 1)
#define                                 RB2PPS1_bit         _BIT_ACCESS(RB2PPS,1)
// RB2PPS<RB2PPS2>
extern volatile __bit                   RB2PPS2             __at(0x105A);	// @ (0x20B * 8 + 2)
#define                                 RB2PPS2_bit         _BIT_ACCESS(RB2PPS,2)
// RB2PPS<RB2PPS3>
